# Tips and Trick Python Pandas 07 !

# Menghapus Missing Values pada Data Frame

- Menghapus (`DROP`)
- Missing Values (`NaN`)

In [1]:
import pandas as pd

print(pd.__version__)

1.2.4

In [3]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  cswnD0uZe2 -1.400860  0.559931       NaN -0.621418
1  7fTxvR8eYn  1.242954       NaN -0.109148 -0.831404
2  LS0oxnokhU  0.832747  1.134462  0.166485 -0.434296
3  QqYzJGOqcC -0.054797 -0.566592  1.544886  1.415669
4  OCNNv0Pv74  0.473036  0.420178 -0.319673  0.951145

# Mengganti Nama Index Tabel

In [4]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  cswnD0uZe2 -1.400860  0.559931       NaN -0.621418
1  7fTxvR8eYn  1.242954       NaN -0.109148 -0.831404
2  LS0oxnokhU  0.832747  1.134462  0.166485 -0.434296
3  QqYzJGOqcC -0.054797 -0.566592  1.544886  1.415669
4  OCNNv0Pv74  0.473036  0.420178 -0.319673  0.951145

# Backup Data Frame

In [6]:
df_backup = df.copy(deep = True)

# Menghapus (drop) setiap kolom yang mengandung Missing Values

In [7]:
df = df.dropna(axis='columns')
df.head()

            Z
0  cswnD0uZe2
1  7fTxvR8eYn
2  LS0oxnokhU
3  QqYzJGOqcC
4  OCNNv0Pv74

# Menghapus setiap kolom yang mengandung missing values berdasarkan threshold

In [8]:
treshold = len(df)*0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z
0  cswnD0uZe2
1  7fTxvR8eYn
2  LS0oxnokhU
3  QqYzJGOqcC
4  OCNNv0Pv74